// Лабораторная работа 3.1

#include "header.h"

#define KOLVO 30

void lab3()
{
	int i, N, toc;
	float a, k, X1, dX, X, Y;

	// подпись
	cout << "Задание 3.1:\tЦиклические алгоритмы\n\t\tОрганизация цикла с несколькими параметрами и проверкой условий\n\nВыполнил:\tстудент гр. 1бИТС2\n\t\tБрянцев А.М.\n\n";

	do
	{
		cout << "Введите значение A (положительное): ";
		cin >> a;
		// ввод а
		if (a <= 0)
		{
			cout << "Введено неверное значение a" << "\n";
		}
	} while (a <= 0);


	do
	{
		cout << "Введите целое, положительное значение параметра N (кол-во точек), большее 1: ";
		cin >> N;
		// ввод точек
		if (N <= 1)
		{
			cout << "Введено неверное значение N" << "\n";
		}
	} while (N <= 1);

	// расчёт X1
	X1 = -10 * a;

	cout << "a = " << a << "\nN = " << N << "\nX1 = " << X1 << endl;
	do
	{
		cout << "Введите значение k (k*a > " << X1 / a << "): ";
		cin >> k; //ввод параметра k
		if (k * a <= X1)
		{
			cout << "Введено неверное значение параметра k" << "\n";
		}
	} while (k * a <= X1);

	dX = a / 2; // dX
	X = X1;
	cout << "N" << setw(10) << "X" << setw(10) << "Y" << setw(1) << endl;
	for (toc = 1; toc < KOLVO; toc++)
	{
		cout << ("_");
	}
	cout << endl;
	for (i = 0; i < N; i++)
	{
		if (X <= k * a) //условие
		{
			Y = -((X + 3 * a) * (X + 3 * a)) - 2 * a; //первый вид
		}
		else
		{
			Y = a * cos(X + 3 * a) - 3 * a; //второй вид
		}
		cout << setw(10) << left << i + 1;
		cout << setw(10) << left << floor(X * 1000 + 0.5) / 1000 << right << setw(10) << left << floor(Y * 1000 + 0.5) / 1000 << endl;//Вывод X
		X = X + dX; // +шаг
	}
}